**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [5]:
import pandas as pd
import numpy as np

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [15]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data,index = labels)
print(df)

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 720.0+ bytes

**3. Print the first 2 rows of the birds dataframe **

In [17]:
print(df[0:2])

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [18]:
print(df[['birds','age']])

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [24]:
df.iloc[[2,3,7]][['birds', 'age', 'visits']]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [25]:
df[df.visits<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [29]:
df[df.age.isnull()][['birds','visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [35]:
df[(df.birds == 'Cranes') & (df.age<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [38]:
df[(df.age>2) & (df.age<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**10. Find the total number of visits of the bird Cranes**

In [53]:
group=df.groupby('birds').sum()
group.visits['Cranes']

12

**11. Calculate the mean age for each different birds in dataframe.**

In [55]:
df.groupby('birds').mean().age

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [91]:
row = [{'birds':'Pegion','age':4.0,'visits':3,'priority':'Yes'}]
df.loc['k']=row[0]
print(df)
df=df.drop(axis = 0,labels='k')
df

        birds  age visits priority
a      Cranes  3.5      2        1
b      Cranes    4      4        1
c     plovers  1.5      3        0
d  spoonbills    0      4        1
e  spoonbills    6      3        0
f      Cranes    3      4        0
g     plovers  5.5      2        0
h      Cranes    0      2        1
i  spoonbills    8      3        0
j  spoonbills    4      2        0
k      Pegion    4      3      Yes

        birds  age visits priority
a      Cranes  3.5      2        1
b      Cranes    4      4        1
c     plovers  1.5      3        0
d  spoonbills    0      4        1
e  spoonbills    6      3        0
f      Cranes    3      4        0
g     plovers  5.5      2        0
h      Cranes    0      2        1
i  spoonbills    8      3        0
j  spoonbills    4      2        0

**13. Find the number of each type of birds in dataframe (Counts)**

In [92]:
df.birds.value_counts()

spoonbills    4
Cranes        4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [93]:
df.sort_values(by=['age'],ascending=False).sort_values(by=['visits'])

        birds  age visits priority
g     plovers  5.5      2        0
j  spoonbills    4      2        0
a      Cranes  3.5      2        1
h      Cranes    0      2        1
i  spoonbills    8      3        0
e  spoonbills    6      3        0
c     plovers  1.5      3        0
b      Cranes    4      4        1
f      Cranes    3      4        0
d  spoonbills    0      4        1

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [94]:
df.loc[df['priority']=='yes','priority'] = 1
df.loc[df.priority == 'no' , 'priority'] = 0
df

        birds  age visits priority
a      Cranes  3.5      2        1
b      Cranes    4      4        1
c     plovers  1.5      3        0
d  spoonbills    0      4        1
e  spoonbills    6      3        0
f      Cranes    3      4        0
g     plovers  5.5      2        0
h      Cranes    0      2        1
i  spoonbills    8      3        0
j  spoonbills    4      2        0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [96]:
df.loc[df['birds']=='Cranes','birds'] = 'trumpeters'
df

        birds  age visits priority
a  trumpeters  3.5      2        1
b  trumpeters    4      4        1
c     plovers  1.5      3        0
d  spoonbills    0      4        1
e  spoonbills    6      3        0
f  trumpeters    3      4        0
g     plovers  5.5      2        0
h  trumpeters    0      2        1
i  spoonbills    8      3        0
j  spoonbills    4      2        0